1. CREATE TABLE employees (

    emp_id INT PRIMARY KEY NOT NULL,

    emp_name TEXT NOT NULL,

    age INT CHECK (age >= 18),

    email TEXT UNIQUE,

    salary DECIMAL DEFAULT 30000

);

2. Purpose of Constraints

  Constraints in a database are rules enforced on data to maintain its integrity and accuracy. They ensure that data is entered, updated, and deleted in a way that adheres to predefined business rules and logic. By preventing invalid or inconsistent data from entering the database, constraints help to:

  *   Improve data quality: Constraints enforce data validation rules, ensuring data is accurate and reliable.
  *   Maintain data consistency: Constraints ensure data conforms to predefined standards, preventing inconsistencies across the database.
  *   Prevent data corruption: Constraints help to prevent accidental or intentional corruption of data by enforcing data integrity rules.
  *   Enhance data reliability: By enforcing data accuracy and consistency, constraints make the database more reliable for decision-making.


  Common Types of Constraints:

  Primary Key (PK) – Ensures each record in a table is unique and not NULL.

  Example: CustomerID in a Customers table.

  Foreign Key (FK) – Maintains referential integrity by ensuring values in one table match values in another.

  Example: OrderID in an Orders table referencing CustomerID in Customers.

  Unique – Ensures all values in a column are distinct.

  Example: Email in a Users table.

  Not Null – Prevents NULL values in a column.
  
  Example: PhoneNumber must always have a value.

  Check – Enforces a condition on column values.

  Example: Age >= 18 in a Users table.

  Default – Assigns a default value if none is provided.

  Example: Status defaults to "Active" in an Employees table.

3. The NOT NULL constraint is applied to a column to ensure that it always contains a valid value and does not accept NULLs. This is useful when a field is essential for record integrity, such as a user's email or an order date.

  A Primary Key (PK) cannot contain NULL values because it uniquely identifies each record in a table. If a primary key allowed NULLs, it would mean some records might not have a unique identifier, violating the uniqueness rule of primary keys. Since NULL represents an unknown or missing value, allowing it in a primary key would compromise data integrity.

4. Steps to Add or Remove Constraints in SQL:

  Adding a Constraint: Use ALTER TABLE with ADD CONSTRAINT.

  Removing a Constraint: Use ALTER TABLE with DROP CONSTRAINT.

  Example: Adding a Constraint

```
# This is formatted as code
ALTER TABLE Users
MODIFY email VARCHAR(255) NOT NULL;
```
  Example: Removing a Constraint
```
# This is formatted as code
ALTER TABLE Users
MODIFY email VARCHAR(255) NULL;
```

5. When attempting to insert, update, or delete data that violates constraints, the database rejects the operation and returns an error. This prevents inconsistent, duplicate, or invalid data from entering the system.

  Examples of Violations & Errors:

  *   Primary Key Violation (Duplicate ID):
```
# This is formatted as code
INSERT INTO Users (UserID, Name) VALUES (1, 'John');
INSERT INTO Users (UserID, Name) VALUES (1, 'Jane'); -- Error!

```

  *   Error Message:
```
# This is formatted as code
ERROR: duplicate key value violates unique constraint "users_pkey"

```

6. You can modify the existing products table using the ALTER TABLE statement to:

  Add a Primary Key to product_id.

  Set a Default Value of 50.00 for price.

  SQL Commands to Modify the Table:


```
# This is formatted as code
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

```

7.
SELECT s.student_name, c.class_name  
FROM Students s  
INNER JOIN Classes c ON s.class_id = c.class_id;

8.
SELECT o.order_id, c.customer_name, p.product_name  
FROM Products p  
LEFT JOIN Orders o ON p.product_id = o.product_id  
INNER JOIN Customers c ON o.customer_id = c.customer_id;

9. SELECT p.product_name, SUM(o.quantity * o.price) AS total_sales  
FROM Orders o  
INNER JOIN Products p ON o.product_id = p.product_id  
GROUP BY p.product_name;

10. SELECT o.order_id, c.customer_name, o.quantity  
FROM Orders o  
INNER JOIN Customers c ON o.customer_id = c.customer_id  
INNER JOIN Products p ON o.product_id = p.product_id;

SQL Commmands

1. Identified Primary Keys (PKs):
  
  A Primary Key uniquely identifies each record in a table and cannot be NULL. Examples from the database:
  *   actor table: actor_id (Primary Key)
  *   actor_award table: actor_award_id (Primary Key)

  Identified Foreign Keys (FKs):

  A Foreign Key establishes a relationship between tables by referencing a Primary Key in another table. Examples:
  *   actor_award table: actor_id (Foreign Key referencing actor_id in the actor table)

  Primary Key (PK):

  Ensures each record is unique.No, must always have a value.Uniquely identifies a row.

  Foreign Key (FK):

  Can have duplicate values.Yes, unless explicitly set to NOT NULL.Establishes relationships between tables.

2. SELECT * FROM actor;

3. SELECT * FROM customer;

4. SELECT DISTINCT country FROM country;

5. SELECT * FROM customer  
WHERE active = 1;

6. SELECT rental_id FROM rental  
WHERE customer_id = 1;

7. SELECT * FROM film  
WHERE rental_duration > 5;

8. SELECT COUNT(*) AS total_films  
FROM film  
WHERE replacement_cost > 15 AND replacement_cost < 20;

9. SELECT COUNT(DISTINCT first_name) AS unique_first_names  
FROM actor;

10. SELECT * FROM customer  
LIMIT 10;

11. SELECT *
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

12. SELECT movie_name  
FROM movies  
WHERE rating = 'G'  
LIMIT 5;

13. SELECT *  
FROM Customers  
WHERE first_name LIKE 'a%';

14. SELECT * FROM Customers  
WHERE first_name LIKE '%a';

15. SELECT city  
FROM Cities  
WHERE city LIKE 'a%A'  
LIMIT 4;

16. SELECT * FROM Customers  
WHERE first_name LIKE '%NI%';

17. SELECT * FROM Customers  
WHERE first_name LIKE '_r%';

18. SELECT *  
FROM Customers  
WHERE first_name LIKE 'A%'  
AND LENGTH(first_name) >= 5;

19. SELECT * FROM Customers
WHERE first_name LIKE 'A%o';

20. SELECT * FROM films  
WHERE rating IN ('PG', 'PG-13');

21. SELECT *
FROM films
WHERE length BETWEEN 50 AND 100;

22. SELECT * FROM Actors  
LIMIT 50;

23. SELECT DISTINCT film_id FROM inventory;

Functions

1. SELECT COUNT(rental_id) AS total_rentals  
FROM rental;

2. SELECT AVG(rental_duration) AS avg_rental_duration  
FROM film;

3. SELECT UPPER(first_name) AS first_name_upper, UPPER(last_name) AS last_name_upper  
FROM Customers;

4. SELECT rental_id, MONTH(rental_date) AS rental_month  
FROM rental;

5. SELECT customer_id, COUNT(rental_id) AS rental_count
FROM rental
GROUP BY customer_id;

6.
SELECT
  store.store_id,
  SUM(payment.amount) AS total_revenue
FROM
  store
JOIN
  staff  ON store.store_id = staff.store_id
JOIN
  payment ON staff.staff_id = payment.staff_id
GROUP BY
  store.store_id;

7. SELECT category.name AS category_name, COUNT(rental.rental_id) AS total_rentals
FROM category
JOIN film_category ON category.category_id = film_category.category_id
JOIN inventory i ON film_categoryc.film_id = i.film_id
JOIN rental ON i.inventory_id = r.inventory_id
GROUP BY category.name
ORDER BY total_rentals DESC;

8. SELECT
  l.name AS language_name,
  AVG(f.rental_rate) AS average_rental_rate
FROM
  language l
JOIN
  film f ON l.language_id = f.language_id
GROUP BY
  l.name;

Joins

9.
SELECT
  film.title AS movie_title,
  customer.first_name AS customer_first_name,
  customer.last_name AS customer_last_name
FROM
  film f
JOIN
  inventory i ON f.film_id = i.film_id
JOIN
  rental r ON i.inventory_id = r.inventory_id
JOIN
  customer c ON r.customer_id = c.customer_id;

10.
SELECT actor.first_name, actor.last_name
FROM actor
JOIN film_actor fa ON actor.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

11.
SELECT
  c.first_name,
  c.last_name,
  SUM(p.amount) AS total_spent
FROM
  customer c
JOIN
  payment p ON c.customer_id = p.customer_id
GROUP BY
  c.customer_id, c.first_name, c.last_name
ORDER BY total_spent DESC;

12.
SELECT
  c.first_name,
  c.last_name,
  GROUP_CONCAT(f.title) AS rented_movies  
FROM
  customer c
JOIN
  address a ON c.address_id = a.address_id
JOIN
  city ci ON a.city_id = ci.city_id
JOIN
  rental r ON c.customer_id = r.customer_id
JOIN
  inventory i ON r.inventory_id = i.inventory_id
JOIN
  film f ON i.film_id = f.film_id
WHERE
  ci.city = 'London'  
GROUP BY
  c.customer_id, c.first_name, c.last_name;

13.
SELECT
  f.title,
  COUNT(r.rental_id) AS rental_count
FROM
  film f
JOIN
  inventory i ON f.film_id = i.film_id
JOIN
  rental r ON i.inventory_id = r.inventory_id
GROUP BY
  f.film_id, f.title  
ORDER BY
  rental_count DESC
LIMIT 5;

14.
SELECT
  c.first_name,
  c.last_name
FROM
  customer c
JOIN
  rental r ON c.customer_id = r.customer_id
JOIN
  inventory i ON r.inventory_id = i.inventory_id
WHERE
  i.store_id IN (1, 2)  
GROUP BY
  c.customer_id, c.first_name, c.last_name
HAVING
  COUNT(DISTINCT i.store_id) = 2;

Windows Function:

1.
SELECT
  customer_id,
  SUM(rental_amount) AS total_spent
FROM
  rentals
GROUP BY
  customer_id
ORDER BY
  total_spent DESC;

2.
SELECT
  film_id,
  rental_date,
  SUM(rental_amount) OVER (PARTITION BY film_id ORDER BY rental_date) AS cumulative_revenue
FROM
  rentals
ORDER BY
  film_id, rental_date;

3.
SELECT
  film_length,
  AVG(rental_duration) AS average_rental_duration
FROM
  films
GROUP BY
  film_length
ORDER BY
  film_length;

4.
WITH RankedFilms AS (
  SELECT
  f.film_id,
  f.title,
  c.category_name,
  COUNT(r.rental_id) AS rental_count,
  ROW_NUMBER() OVER (PARTITION BY c.category_name ORDER BY COUNT(r.rental_id) DESC) AS rank
  FROM films f
  JOIN categories c ON f.category_id = c.category_id
  LEFT JOIN rentals r ON f.film_id = r.film_id
  GROUP BY f.film_id, f.title, c.category_name
)
SELECT
    film_id,
    title,
    category_name,
    rental_count
FROM
    RankedFilms
WHERE
    rank <= 3
ORDER BY
    category_name, rental_count DESC;

5.
WITH CustomerRentals AS (
SELECT  customer_id,
 COUNT(rental_id) AS total_rentals
FROM  rentals
GROUP BY  customer_id
),
AverageRentals AS (
SELECT AVG(total_rentals) AS avg_rentals
FROM CustomerRentals
)
SELECT
  cr.customer_id,
    cr.total_rentals,
    ar.avg_rentals,
    (cr.total_rentals - ar.avg_rentals) AS rental_difference
FROM
    CustomerRentals cr,
    AverageRentals ar
ORDER BY
    rental_difference DESC;

6.
SELECT
    DATE_TRUNC('month', rental_date) AS month,
    SUM(rental_amount) AS total_revenue
FROM
    rentals
GROUP BY
    month
ORDER BY
    month;

7.
WITH CustomerSpending AS (
  SELECT customer_id,
    SUM(rental_amount) AS total_spent
  FROM rentals
  GROUP BY customer_id
),
SpendingThreshold AS (
  SELECT
     PERCENTILE_CONT(0.8) WITHIN GROUP (ORDER BY total_spent) AS threshold
  FROM CustomerSpending
)
SELECT
    cs.customer_id,
    cs.total_spent
FROM
    CustomerSpending cs,
    SpendingThreshold st
WHERE
    cs.total_spent >= st.threshold
ORDER BY
    cs.total_spent DESC;

8.
WITH CategoryRentals AS (
    SELECT c.category_name,
    COUNT(r.rental_id) AS rental_count
    FROM categories c
    LEFT JOIN
      films f ON c.category_id = f.category_id
    LEFT JOIN
      rentals r ON f.film_id = r.film_id
    GROUP BY
      c.category_name
)
SELECT
    category_name,
    rental_count,
    SUM(rental_count) OVER (ORDER BY rental_count) AS running_total
FROM
    CategoryRentals
ORDER BY
    rental_count;

9.
WITH FilmRentals AS (
    SELECT
      f.film_id,
      f.title,
      c.category_name,
      COUNT(r.rental_id) AS rental_count
    FROM films f
    JOIN
      categories c ON f.category_id = c.category_id
    LEFT JOIN
      rentals r ON f.film_id = r.film_id
    GROUP BY
      f.film_id, f.title, c.category_name
),
CategoryAverages AS (
    SELECT category_name,
      AVG(rental_count) AS avg_rental_count
    FROM FilmRentals
    GROUP BY category_name
)
SELECT
    fr.film_id,
    fr.title,
    fr.category_name,
    fr.rental_count
FROM
    FilmRentals fr
JOIN
    CategoryAverages ca ON fr.category_name = ca.category_name
WHERE
    fr.rental_count < ca.avg_rental_count
ORDER BY
    fr.category_name, fr.rental_count;

10.
SELECT
    DATE_TRUNC('month', rental_date) AS month,
    SUM(rental_amount) AS total_revenue
FROM
    rentals
GROUP BY
    month
ORDER BY
    total_revenue DESC
LIMIT 5;

Normalisation & CTE

1. Step 1: Identify Non-Atomic Values

  Identify the columns that contain non-atomic values. In this case, the category column.

  Step 2: Create a New Table for Categories

  Create a new table to store categories separately. This new table will have a unique identifier for each category.

```
  CREATE TABLE film_category (
    film_id INT,
    category_id INT,
    PRIMARY KEY (film_id, category_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id),
    FOREIGN KEY (category_id) REFERENCES category(category_id)
  );
```
  Step 3: Populate the New Table

  Populate the film_category table with the appropriate relationships between films and categories. Each film will have a separate row for each category it belongs to.

```
INSERT INTO film_category (film_id, category_id)
SELECT f.film_id, c.category_id
FROM film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON c.category_name IN (SELECT category_name FROM film_category WHERE film_id = f.film_id);
```

  Step 4: Remove Non-Atomic Values from the Original Table

  Remove the non-atomic category column from the original film table, ensuring that each film has a unique entry in the film table.

  Step 5: Ensure All Other Columns are Atomic

  Review all other columns in the film table to ensure they contain atomic values and meet the requirements of 1NF.

2. considering that the film_actor table in the Sakila database, which is used to associate films with their respective actors.

  Determining Whether the film_actor Table is in 2NF:

  Definition of 2NF:

  A table is in Second Normal Form (2NF) if:
  It is already in First Normal Form (1NF).
  All non-key attributes are fully functionally dependent on the entire primary key (i.e., there are no partial dependencies).
  
  Structure of the film_actor Table:

  The film_actor table typically has the following columns:
  film_id (part of the primary key)
  actor_id (part of the primary key)
  Other attributes (if any, such as last_update)

  Checking for 1NF:

  Ensure that the film_actor table is in 1NF:
  Each column contains atomic values.
  Each column has unique names.
  The order of data does not matter.
  The film_actor table is likely in 1NF as it contains unique pairs of film_id and actor_id.
  Checking for Partial Dependencies:

  The primary key for the film_actor table is a composite key consisting of film_id and actor_id.
  Check if there are any non-key attributes that depend only on part of the primary key:
  If there are additional attributes (e.g., last_update), they should depend on the entire primary key, not just one part of it.
  If last_update is dependent only on film_id or actor_id, then the table violates 2NF.

  Steps to Normalize the film_actor Table to Achieve 2NF:

  Identify Partial Dependencies:

  Determine which non-key attributes depend only on part of the composite primary key.

  Create New Tables:

  If there are non-key attributes that depend only on film_id, create a new table for films. If there are attributes that depend only on actor_id, create a new table for actors.

  Update the film_actor Table:

  Remove any non-key attributes from the film_actor table that are now stored in the new film and actor tables.
  
  The film_actor table should only contain the composite primary key and any attributes that are directly related to the relationship between films and actors.

  Populate the New Tables:

  Insert the relevant data into the new film and actor tables from the original film_actor table.

  Ensure All Non-Key Attributes are Fully Dependent:

  Review the new structure to ensure that all non-key attributes in the film and actor tables are fully dependent on their respective primary keys

3. considering the customer table in the Sakila database, which contains information about customers.

  Transitive Dependencies in the customer Table:

  Structure of the customer Table:

  The customer table typically has the following columns:

  customer_id (Primary Key)
  store_id (Foreign Key)
  first_name
  last_name
  email
  address_id (Foreign Key)
  active
  create_date
  last_update
  
  Additionally, the address_id can be linked to an address table that contains address details.

  Transitive Dependency:

  A transitive dependency occurs when a non-key attribute depends on another non-key attribute rather than directly on the primary key.

  In the customer table, there is a transitive dependency:

  customer_id → address_id → address (where address includes fields like address, district, city_id, etc.)

  Here, address_id is a non-key attribute that determines the address details, which are not directly dependent on customer_id. This means that if you change the address for a customer, you also need to update the address details in the address table, leading to potential anomalies.

  Steps to Normalize the customer Table to Achieve 3NF:

  Identify Transitive Dependencies:

  Recognize that address_id is causing a transitive dependency by linking to the address table.

  Create a Separate Address Table:

  Ensure that the address table is properly defined and contains all relevant address details.

  Remove Transitive Dependencies from the Customer Table:

  Ensure that the customer table only contains attributes that are directly dependent on the primary key (customer_id).

  The customer table should reference the address table through address_id without including address details directly in the customer table.

  Update the Customer Table Structure.

  Ensure All Non-Key Attributes are Fully Dependent:

  Review the customer table to ensure that all non-key attributes are fully functionally dependent on the primary key (customer_id) and that there are no transitive dependencies.

  Populate the Address Table:

  If necessary, populate the address table with existing address data from the customer table to maintain data integrity.

4. film_category_unnormalized (
    film_id INT,
    title VARCHAR(255),
    categories VARCHAR(255)  -- Comma-separated list of categories
)

5. WITH ActorFilmCount AS (
    SELECT
      a.actor_id,
      CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
      COUNT(fa.film_id) AS film_count
    FROM actor a
    LEFT JOIN
      film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY
      a.actor_id, a.first_name, a.last_name
)
SELECT
    actor_name,
    film_count
FROM
    ActorFilmCount
ORDER BY
    film_count DESC;

6. WITH FilmLanguageInfo AS (
    SELECT
      f.title AS film_title,
      l.name AS language_name,
      f.rental_rate
    FROM film f
    JOIN
      language l ON f.language_id = l.language_id
)
SELECT
    film_title,
    language_name,
    rental_rate
FROM
    FilmLanguageInfo
ORDER BY
    film_title;

7. WITH CustomerRevenue AS (
    SELECT
      c.customer_id,
      CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
      SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN
      payment p ON c.customer_id = p.customer_id
    GROUP BY
      c.customer_id, c.first_name, c.last_name
)
SELECT
    customer_id,
    customer_name,
    total_revenue
FROM
    CustomerRevenue
ORDER BY
    total_revenue DESC;

8. WITH RankedFilms AS (
    SELECT
      f.film_id,
      f.title,
      f.rental_duration,
      RANK() OVER (ORDER BY f.rental_duration DESC) AS rental_rank
    FROM film f
)
SELECT
    film_id,
    title,
    rental_duration,
    rental_rank
FROM
    RankedFilms
ORDER BY
    rental_rank;

9. WITH CustomerRentalCount AS (
    SELECT
      c.customer_id,
      CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
      COUNT(p.payment_id) AS rental_count
    FROM customer c
    JOIN
      payment p ON c.customer_id = p.customer_id
    GROUP BY
      c.customer_id, c.first_name, c.last_name
    HAVING COUNT(p.payment_id) > 2
)
SELECT
    crc.customer_id,
    crc.customer_name,
    c.email,
    c.active,
    c.create_date,
    c.last_update
FROM
    CustomerRentalCount crc
JOIN
    customer c ON crc.customer_id = c.customer_id
ORDER BY
    crc.customer_name;

10. WITH MonthlyRentals AS (
    SELECT
      DATE_TRUNC('month', rental_date) AS rental_month,
      COUNT(*) AS total_rentals
    FROM rental
    GROUP BY
      DATE_TRUNC('month', rental_date)
)
SELECT
    rental_month,
    total_rentals
FROM
    MonthlyRentals
ORDER BY
    rental_month;

11. WITH ActorPairs AS (
    SELECT
      fa1.actor_id AS actor1_id,
      fa2.actor_id AS actor2_id,
      fa1.film_id
    FROM film_actor fa1
    JOIN
      film_actor fa2 ON fa1.film_id = fa2.film_id
    WHERE
      fa1.actor_id < fa2.actor_id  -- Ensures each pair is unique and avoids duplicates
)
SELECT
    ap.actor1_id,
    ap.actor2_id,
    COUNT(*) AS films_together
FROM
    ActorPairs ap
GROUP BY
    ap.actor1_id, ap.actor2_id
ORDER BY
    films_together DESC;

12. WITH RECURSIVE EmployeeHierarchy AS (
    -- Anchor member: Select the specific manager
    SELECT
      staff_id,
      first_name,
      last_name,
      reports_to
    FROM staff
    WHERE
      staff_id = <specific_manager_id>  -- Replace <specific_manager_id> with the actual manager's ID

    UNION ALL

    -- Recursive member: Select employees who report to the employees found in the previous step
    SELECT
      s.staff_id,
      s.first_name,
      s.last_name,
      s.reports_to
    FROM staff s
    INNER JOIN
      EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)
SELECT
    staff_id,
    first_name,
    last_name
FROM
    EmployeeHierarchy
ORDER BY
    last_name, first_name;